; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v8 - type_3 ?v2 - type_2)
 	      (pred_4 ?v4 - object ?v2 - type_2)
	      (pred_1 ?v8 - type_3 ?v3 - type_1)
	      (pred_2 ?v8 - type_3 ?v4 - object ?v3 - type_1))

   (:action op_1
       :parameters  (?v8 - type_3 ?v5 ?v7 - type_2)
       :precondition (and  (pred_3 ?v8 ?v5))
       :effect (and  (pred_3 ?v8 ?v7)
		     (not (pred_3 ?v8 ?v5))))

   (:action op_2
       :parameters (?v8 - type_3 ?v1 - object ?v6 - type_2 ?v3 - type_1)
       :precondition  (and  (pred_4 ?v1 ?v6) (pred_3 ?v8 ?v6) (pred_1 ?v8 ?v3))
       :effect (and (pred_2 ?v8 ?v1 ?v3)
		    (not (pred_4 ?v1 ?v6)) 
		    (not (pred_1 ?v8 ?v3))))

   (:action op_3
       :parameters (?v8 - type_3 ?v1 - object ?v6 - type_2 ?v3 - type_1)
       :precondition  (and  (pred_2 ?v8 ?v1 ?v3) (pred_3 ?v8 ?v6))
       :effect (and (pred_4 ?v1 ?v6)
		    (pred_1 ?v8 ?v3)
		    (not (pred_2 ?v8 ?v1 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_10 obj_03 - type_3
obj_01 obj_11 obj_06 obj_05 - type_1
obj_02 obj_07 obj_04 obj_08 - type_2
obj_14 obj_09 obj_12 obj_13 - object)
(:init
(pred_3 obj_10 obj_08)
(pred_1 obj_10 obj_01)
(pred_1 obj_10 obj_11)
(pred_3 obj_03 obj_04)
(pred_1 obj_03 obj_06)
(pred_1 obj_03 obj_05)
(pred_4 obj_14 obj_07)
(pred_4 obj_09 obj_08)
(pred_4 obj_12 obj_07)
(pred_4 obj_13 obj_07)
)
(:goal
(and
(pred_4 obj_14 obj_02)
(pred_4 obj_09 obj_08)
(pred_4 obj_12 obj_04)
(pred_4 obj_13 obj_04)
)
)

(:constraints
  (always (not (pred_3 obj_10 obj_04)))
)
)

; plan
1. (op_1 obj_10 obj_08 obj_07)
   deleted: (pred_3 obj_10 obj_08)
   added: (pred_3 obj_10 obj_07)
   goals met: 1 of 4
2. (op_1 obj_03 obj_04 obj_07)
   deleted: (pred_3 obj_03 obj_04)
   added: (pred_3 obj_03 obj_07)
   goals met: 1 of 4
3. (op_2 obj_10 obj_14 obj_07 obj_11)
   deleted: (pred_4 obj_14 obj_07) (pred_1 obj_10 obj_11)
   added: (pred_2 obj_10 obj_14 obj_11)
   goals met: 1 of 4
4. (op_2 obj_03 obj_13 obj_07 obj_05)
   deleted: (pred_4 obj_13 obj_07) (pred_1 obj_03 obj_05)
   added: (pred_2 obj_03 obj_13 obj_05)
   goals met: 1 of 4
5. (op_2 obj_03 obj_12 obj_07 obj_06)
   deleted: (pred_4 obj_12 obj_07) (pred_1 obj_03 obj_06)
   added: (pred_2 obj_03 obj_12 obj_06)
   goals met: 1 of 4
6. (op_1 obj_10 obj_07 obj_02)
   deleted: (pred_3 obj_10 obj_07)
   added: (pred_3 obj_10 obj_02)
   goals met: 1 of 4
7. (op_1 obj_03 obj_07 obj_04)
   deleted: (pred_3 obj_03 obj_07)
   added: (pred_3 obj_03 obj_04)
   goals met: 1 of 4
8. (op_3 obj_10 obj_14 obj_02 obj_11)
   deleted: (pred_2 obj_10 obj_14 obj_11)
   added: (pred_4 obj_14 obj_02) (pred_1 obj_10 obj_11)
   goals met: 2 of 4
9. (op_3 obj_03 obj_13 obj_04 obj_05)
   deleted: (pred_2 obj_03 obj_13 obj_05)
   added: (pred_4 obj_13 obj_04) (pred_1 obj_03 obj_05)
   goals met: 3 of 4
10. (op_3 obj_03 obj_12 obj_04 obj_06)
   deleted: (pred_2 obj_03 obj_12 obj_06)
   added: (pred_4 obj_12 obj_04) (pred_1 obj_03 obj_06)
   goals met: 4 of 4
